{"items": 
    {"Things Sar Likes":
        [{"Anime": ["sailor moon", "naruto", "card captor"]},
    "France",
            {"Cooking": 
                ["drinks",
                    {"food": {
                        "regrowing plants":
                            [  {"lettuce":
                                    {"type": "leafy vegetable",
                                    "method": "" }
                                },
                                {"celery":
                                    {"type": "weird vegetable",
                                    "method": ""}
                                },
                                {"lemongrass": 
                                { "type": "herb",
                                    "method": "If you love using lemongrass but have a difficult time finding it, simply regrow your own. Lemongrass will grow just like regular grass. You just place the root that is leftover in a glass bowl or jar with enough water to cover it and leave it in the sunlight. After about a week, you will notice new growth and when this happens you can transplant your lemongrass in a pot or in your herb garden."
                                }
                                },
                                {"avocado":
                                    {"type": "yum",
                                    "method":"Avocado seeds can be used to grow a steady supply of this super food. You just have to wash the seed and use toothpicks to suspend it over water in a bowl or jar. The water should come up enough to cover the bottom inch of the seed. Keep the container in a warm place but not in direct sunlight and remember to check the water every day and add more as needed. It can take up to six weeks for the stem and roots to appear and once the stem reaches about 6 inches you will need to cut it down to 3 inches. When leaves begin appearing, you can plant the seed in soil, remembering to leave about half of it above ground."
                                }
                            },
                    {"source": "https://www.diyncrafts.com/4732/repurpose/25-foods-can-re-grow-kitchen-scraps"
                    }

                            ],

                    "most nutritious foods": {
                    "vitamin D": [],
                    "": ""
                                            },

                    "best foods for skin": {},

                    "best foods according to Deepak and Kimberly": {},

                "cheapest food": {}
                            }
                }
                ]
            }, {"working out": 
                ["skating", "lacrosse", "gymnastics", "karate", "biking"]
                },
            "hello kitty"
        ]
    }
}